In [13]:
import pandas as pd
import seaborn as sns
df= pd.read_excel('Training Efficiency.xlsx')
df.head()

,Class,Batch,Name,Gender,Course,laptop_availability,before_training,after_training,exam score,Status
0,1 st Year,Batch 1,ANJANA,Female,BA,Yes,13,22,924,Pass
1,1 st Year,Batch 1,JOSEPH,Male,B.Com / BBA,Yes,21,22,924,Pass
2,1 st Year,Batch 1,JOSNA,Female,B.Com / BBA,Yes,16,22,924,Pass
3,1 st Year,Batch 1,Judith,Male,BA,No,22,20,840,Pass
4,1 st Year,Batch 1,Vineetha,Female,B.Com / BBA,Yes,19,13,546,Fail

In [14]:
df.corr()

                 before_training  after_training  exam score
before_training         1.000000        0.394396    0.398184
after_training          0.394396        1.000000    0.994638
exam score              0.398184        0.994638    1.000000

In [16]:
df['after_training'].corr(df['exam score'])

0.9946380997234993

after training and final exam score are highly correlated arround 99%

In [ ]:
sns.heatmap(df.corr(),cbar=True)

In [ ]:
sns.pairplot(df)

we can see the graph is linearly poitive correlated of after training and final exam score